it/src/Documents/РаспределениеЛицензий/РаспределениеЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспределениеЛицензий</name>
  <registerRecords>AccumulationRegister.РазмещениеЛицензий</registerRecords>
  <registerRecords>AccumulationRegister.ЛицензииОрганизации</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияНакопления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКомпьютера</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лицензия</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУстановлено</name>
      <type>
        <types>CatalogRef.ИдентификаторыПрограмм</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

it/src/AccumulationRegisters/РазмещениеЛицензий/РазмещениеЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РазмещениеЛицензий</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторУстановлено</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/AccumulationRegisters/ЛицензииОрганизации/ЛицензииОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛицензииОрганизации</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лицензия</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

it/src/Documents/РаспределениеЛицензий/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА


///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ДОКУМЕНТА


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения = Неопределено) Экспорт
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначенияСервер.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначенияСервер.СформироватьДеревоПолейЗапросаПоШапке();
	
	СтруктураШапкиДокумента = ОбщегоНазначенияСервер.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияСервер.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
КонецПроцедуры // ПодготовитьСтруктуруШапкиДокумента() 

// Процедура формирует таблицы документа.
//
Процедура ПодготовитьТаблицыДокумента() Экспорт
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРаспределениеЛицензий", Документы.РаспределениеЛицензий.ПолучитьТаблицуРаспределениеЛицензий(ДополнительныеСвойства));
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицензииОрганизации", Документы.РаспределениеЛицензий.ПолучитьТаблицуЛицензииОрганизации(ДополнительныеСвойства));
	
КонецПроцедуры // ПодготовитьТаблицыДокумента()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары,
//  ТаблицаПоСкидкам          - таблица значений, содержащая данные для проведения и проверки ТЧ Скидки,
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  ТаблицаПоУслугам          - таблица значений, содержащая данные для проведения и проверки ТЧ "Услуги",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ДополнительныеСвойства, Отказ, Заголовок)
	
	ОтражениеПоРегистрамСервер.ОтразитьЛицензииОрганизации(ДополнительныеСвойства, Движения, Отказ);
	ОтражениеПоРегистрамСервер.ОтразитьРаспределенияЛицензий(ДополнительныеСвойства, Движения, Отказ);
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
    Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
    
		Возврат;
		
	КонецЕсли;

КонецПроцедуры


// Функция формирует временные данных документа.
//
// Возвращаемое значение:
//	МенеджерВременныхТаблиц - менеджер временных таблиц
//
Функция ВременныеТаблицыДанныхДокумента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РаспределениеЛицензийОсновныеСредства.ВидДвижения,
	               |	РаспределениеЛицензийОсновныеСредства.ПодразделениеОрганизации,
	               |	РаспределениеЛицензийОсновныеСредства.ИдентификаторКомпьютера,
	               |	РаспределениеЛицензийОсновныеСредства.Лицензия,
	               |	РаспределениеЛицензийОсновныеСредства.ИдентификаторУстановлено,
	               |	СУММА(РаспределениеЛицензийОсновныеСредства.Количество) КАК Количество
	               |ПОМЕСТИТЬ втТаблицаОсновныеСредства
	               |ИЗ
	               |	Документ.РаспределениеЛицензий.ОсновныеСредства КАК РаспределениеЛицензийОсновныеСредства
	               |ГДЕ
	               |	РаспределениеЛицензийОсновныеСредства.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РаспределениеЛицензийОсновныеСредства.ВидДвижения,
	               |	РаспределениеЛицензийОсновныеСредства.ПодразделениеОрганизации,
	               |	РаспределениеЛицензийОсновныеСредства.ИдентификаторКомпьютера,
	               |	РаспределениеЛицензийОсновныеСредства.ИдентификаторУстановлено,
	               |	РаспределениеЛицензийОсновныеСредства.Лицензия";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапрос = Запрос.Выполнить();
	
	Возврат МенеджерВременныхТаблиц;
	
КонецФункции // ВременныеТаблицыДанныхДокумента()


// <Описание процедуры>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ЗаполнитьВременныеТаблицы(Отказ)

	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерВременныхТаблиц = ВременныеТаблицыДанныхДокумента();

КонецПроцедуры // ЗаполнитьВременныеТаблицы()
 

// Процедура - обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОтражениеПоРегистрамСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ЗаполнитьВременныеТаблицы(Отказ);
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры


Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	// Контроль выполняется при проведении\отмене проведения не нового документа.

	Если ДополнительныеСвойства.ДляПроведения.РежимПроведения = РежимПроведенияДокумента.Оперативный
		И ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Массив.Добавить(Движения.РазмещениеЛицензий);
		Массив.Добавить(Движения.ЛицензииОрганизации);
	КонецЕсли;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры // СформироватьСписокРегистровДляКонтроля()


// Процедура - обработчик события ОбработкаПроведения объекта.
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	Перем ТаблицаПроверки;
	
	
	//// Подготовим структуру шапки документа
	//ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, РежимПроведения);
	
	ОтражениеПоРегистрамСервер.ДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	ОтражениеПоРегистрамСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ПодготовитьТаблицыДокумента();
	
	Если Не Отказ Тогда
		
		ДвиженияПоРегистрам(РежимПроведения, ДополнительныеСвойства, Отказ, Заголовок);
		
		СформироватьСписокРегистровДляКонтроля();
		
		ОтражениеПоРегистрамСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ОтражениеПоРегистрамСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
		
		ОтражениеПоРегистрамСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
	КонецЕсли;
	
КонецПроцедуры
